In [66]:
#Naive Bayes
import pandas as pd

In [67]:
df=pd.read_csv("Titanic-Dataset.csv")
df.head(1)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [68]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Embarked','Cabin','Ticket'], axis='columns')
df.head()

   Survived  Pclass  Gender   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [69]:
from sklearn.preprocessing import LabelEncoder
label = LabelEncoder()
df['Gender'] = label.fit_transform(df['Gender'])
df.head()

   Survived  Pclass  Gender   Age     Fare
0         0       3       1  22.0   7.2500
1         1       1       0  38.0  71.2833
2         1       3       0  26.0   7.9250
3         1       1       0  35.0  53.1000
4         0       3       1  35.0   8.0500

In [70]:
input=df.drop(['Survived'],axis='columns')
input.head()

   Pclass  Gender   Age     Fare
0       3       1  22.0   7.2500
1       1       0  38.0  71.2833
2       3       0  26.0   7.9250
3       1       0  35.0  53.1000
4       3       1  35.0   8.0500

In [71]:
target=df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [72]:
input.columns[input.isna().any()]
input

     Pclass  Gender   Age     Fare
0         3       1  22.0   7.2500
1         1       0  38.0  71.2833
2         3       0  26.0   7.9250
3         1       0  35.0  53.1000
4         3       1  35.0   8.0500
..      ...     ...   ...      ...
886       2       1  27.0  13.0000
887       1       0  19.0  30.0000
888       3       0   NaN  23.4500
889       1       1  26.0  30.0000
890       3       1  32.0   7.7500

[891 rows x 4 columns]

In [75]:
input.Age = input.Age.fillna(input.Age.mean())
input

     Pclass  Gender        Age     Fare
0         3       1  22.000000   7.2500
1         1       0  38.000000  71.2833
2         3       0  26.000000   7.9250
3         1       0  35.000000  53.1000
4         3       1  35.000000   8.0500
..      ...     ...        ...      ...
886       2       1  27.000000  13.0000
887       1       0  19.000000  30.0000
888       3       0  29.699118  23.4500
889       1       1  26.000000  30.0000
890       3       1  32.000000   7.7500

[891 rows x 4 columns]

In [86]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(input,target,test_size=0.2)
len(y_test)

179

In [87]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(x_train,y_train)

GaussianNB()

In [88]:
model.score(x_test,y_test)

0.7988826815642458

In [89]:
x_test[:10]

     Pclass  Gender        Age     Fare
369       1       0  24.000000  69.3000
539       1       0  22.000000  49.5000
652       3       1  21.000000   8.4333
483       3       0  63.000000   9.5875
575       3       1  19.000000  14.5000
68        3       0  17.000000   7.9250
487       1       1  58.000000  29.7000
490       3       1  29.699118  19.9667
480       3       1   9.000000  46.9000
245       1       1  44.000000  90.0000

In [90]:
y_test[:10]

C:\Users\mpatil112376\AppData\Local\Temp\ipykernel_19612\2588316582.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[:10]

369    1
539    1
652    0
483    1
575    0
68     1
487    0
490    0
480    0
245    0
Name: Survived, dtype: int64

In [92]:
model.predict(x_test[:10])

array([1, 1, 0, 1, 0, 1, 0, 0, 0, 1], dtype=int64)